###############################################################
#  Generated by:      Cadence Innovus 21.19-s058_1
#  OS:                Linux x86_64(Host ID vlsi.iitgn.ac.in)
#  Generated on:      Sat Apr 11 02:08:06 2026
#  Design:            microprocessor_pad_top
#  Command:           saveDesign microprocessor_pad_top_placement.enc
###############################################################
current_design microprocessor_pad_top
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock  -name vir_clk_i -period 10.000000 -waveform {0.000000 5.000000}
set_wire_load_mode enclosed
set_max_fanout 20  [get_designs {microprocessor_pad_top}]
set_dont_use  [get_lib_cells {tsl18fs120_scl_ss/slbhb1}]
set_dont_use  [get_lib_cells {tsl18fs120_scl_ss/slbhb4}]
set_dont_use  [get_lib_cells {tsl18fs120_scl_ss/slbhb2}]
